# APAN 5310 Group Project Team 2

## Import Packages

In [1]:
import pandas as pd
from sqlalchemy import create_engine

## Connect to the PostgreSQL

In [2]:
# Pass the connection string to a variable, conn_url
conn_url = 'postgresql://postgres:123@localhost/GroupProject'

# Create an engine that connects to PostgreSQL server
engine = create_engine(conn_url)

# Establish a connection
connection = engine.connect()

## Create Tables

In [3]:
# Pass the SQL statements that create all tables

createCmd = """CREATE TABLE recruiter (
                recruiter_id             int,
                recruiter_name           varchar(50) NOT NULL,
                PRIMARY KEY(recruiter_id)
            );

            CREATE TABLE location (
                location_id      int,
                city             varchar(50) NOT NULL,
                street           varchar(50) NOT NULL,
                state            char(2)NOT NULL,
                zipcode          char(5)NOT NULL,
                distance_from_home int NOT NULL,
                PRIMARY KEY(location_id)
            );

            CREATE TABLE department (
                department_id    int,
                dept_name        varchar(30) NOT NULL,
                employee_number  int,
                PRIMARY KEY(department_id)
            );

            CREATE TABLE employee (
                employee_id        int,
                last_name          varchar(50) NOT NULL,
                first_name         varchar(50) NOT NULL,
                age                int NOT NULL,
                gender             varchar(30) NOT NULL,
                marital_status     varchar(15) NOT NULL,
                education_level    varchar(50) NOT NULL,
                education_filed    varchar(50) NOT NULL,
                location_id        int,
                department_id      int,
                PRIMARY KEY(employee_id),
                FOREIGN KEY(location_id) REFERENCES location (location_id),
                FOREIGN KEY(department_id) REFERENCES department (department_id)
            );
            
            CREATE TABLE interview (
                recruiter_id            int,
                employee_id             int,
                recruit_date            date NOT NULL,
                interview_performance   varchar(50),
                PRIMARY KEY(recruiter_id,employee_id),
                FOREIGN KEY(recruiter_id) REFERENCES recruiter (recruiter_id),
                FOREIGN KEY(employee_id) REFERENCES employee (employee_id)
    
            );
            
            CREATE TABLE job_history (
                employee_his_id               int,
                employee_id                   int,
                num_of_companies_worked       int,
                total_working_years           int,
                PRIMARY KEY(employee_his_id),
                FOREIGN KEY(employee_id) REFERENCES employee (employee_id)
            );

            CREATE TABLE attrition (
                attrition_id       int,
                employee_id        int,
                attrition_status   boolean NOT NULL,
                attrition_date     date,
                PRIMARY KEY(attrition_id),
                FOREIGN KEY(employee_id) REFERENCES employee (employee_id)	
            );

            CREATE TABLE promotion (
                promotion_id               int,
                employee_id                int,
                years_since_last_promotion int,
                performance_rating         varchar(50) NOT NULL,
                PRIMARY KEY(promotion_id),
                FOREIGN KEY(employee_id) REFERENCES employee (employee_id)
            );

            CREATE TABLE training (
                training_id                int,
                training_name              varchar(50) NOT NULL,
                training_description       text,
                PRIMARY KEY(training_id)
            );

            CREATE TABLE employee_training (
                employee_id       int,
                training_id       int,
                PRIMARY KEY(employee_id, training_id),
                FOREIGN KEY(employee_id) REFERENCES employee (employee_id),
                FOREIGN KEY(training_id) REFERENCES training (training_id)
            );

            CREATE TABLE survey (
                survey_id                 int,
                environment_satisfaction  varchar(20) NOT NULL,
                job_satisfaction          varchar(20) NOT NULL,
                relationship_satisfaction varchar(20) NOT NULL,
                work_life_balance         varchar(20) NOT NULL,
                employee_id               int,
                PRIMARY KEY(survey_id),	
                FOREIGN KEY(employee_id) REFERENCES employee (employee_id)
            );

            CREATE TABLE history_in_company (
                history_id                 int,
                employee_id                int,
                years_with_current_manager int,
                years_at_company           int,
                PRIMARY KEY(history_id),
                FOREIGN KEY(employee_id) REFERENCES employee(employee_id)
            );

            CREATE TABLE REF_job_role (
                role_id                    int,
                role_name                  varchar(30) NOT NULL,
                PRIMARY KEY(role_id)
            );

            CREATE TABLE REF_job_level (
                level_id                    int,
                level_desc                  varchar(50) NOT NULL,
                PRIMARY KEY(level_id)
            );

            CREATE TABLE job (
                job_id                     int,
                employee_id                int,
                business_travel            varchar(30) NOT NULL,
                years_in_current_role      int,
                role_id                    int NOT NULL,
                level_id                   int NOT NULL,
                PRIMARY KEY(job_id),
                FOREIGN KEY(employee_id) REFERENCES employee (employee_id),
                FOREIGN KEY(role_id) REFERENCES REF_job_role (role_id),
                FOREIGN KEY(level_id) REFERENCES REF_job_level (level_id)		
            );

            CREATE TABLE salary (
                salary_id                  int,
                monthly_income             int NOT NULL check (monthly_income>=0),
                percent_salary_hike        int,
                stock_option_level         int NOT NULL,
                job_id                     int,
                PRIMARY KEY(salary_id),
                FOREIGN KEY(job_id) REFERENCES job(job_id)
            );

            CREATE TABLE payroll (
                payroll_id                 int,
                employee_id                int,
                salary_id                  int,
                payroll_date               date NOT NULL,
                total_amount               numeric NOT NULL check (total_amount>=0),
                over_time                  boolean NOT NULL,
                PRIMARY KEY(payroll_id),
                FOREIGN KEY(employee_id) REFERENCES employee (employee_id),
                FOREIGN KEY(salary_id) REFERENCES salary (salary_id)	
            );"""

# Execute the statement to create tables
connection.execute(createCmd)

## Data Exploration

In [4]:
# Load the csv file in a dataframe, df:
df = pd.read_csv('Project_data.csv')

In [5]:
df.head()

,age,attrition_status,business_travel,dept_name,distance_from_home,education_level,education_filed,employee_id,environment_satisfaction,gender,...,training_name,training_description,attrition_date,recruit_date,employee_number,payroll_date,total_amount,first_name,last_name,recruiter_name
0,41,Yes,Travel_Rarely,Sales,1,College,Life Sciences,1,Medium,Female,...,Product or service training,About the products or services,12/19/2020,2/21/2018,450,11/22/2019,6891.95,Ferne,Cattle,Elfrida Duligal
1,49,No,Travel_Frequently,Research & Development,8,Below College,Life Sciences,2,High,Male,...,Technical skill training,Programing skills,NaN,1/12/2018,1000,12/7/2021,5899.50,Betta,McCrone,Lebbie Collough
2,37,Yes,Travel_Rarely,Research & Development,2,College,Other,4,Very High,Male,...,Technical skill training,Programing skills,6/19/2021,2/1/2018,1000,8/9/2020,2403.50,Vonny,Swainsbury,Whitney Leatham
3,33,No,Travel_Frequently,Research & Development,3,Master,Life Sciences,5,Very High,Female,...,Technical skill training,Programing skills,NaN,11/23/2017,1000,9/25/2020,3345.35,Jacquette,Dennistoun,Robers Campagne
4,27,No,Travel_Rarely,Research & Development,2,Below College,Medical,7,Low,Male,...,Technical skill training,Programing skills,NaN,7/20/2018,1000,4/3/2021,3988.20,Frederic,Gartin,Monti Cowpland

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1478 entries, 0 to 1477
Data columns (total 42 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   age                         1478 non-null   int64
 1   attrition_status            1478 non-null   object
 2   business_travel             1478 non-null   object
 3   dept_name                   1478 non-null   object
 4   distance_from_home          1478 non-null   int64
 5   education_level             1478 non-null   object
 6   education_filed             1478 non-null   object
 7   employee_id                 1478 non-null   int64
 8   environment_satisfaction    1478 non-null   object
 9   gender                      1478 non-null   object
 10  interview_performance       1478 non-null   object
 11  level_desc                  1478 non-null   object
 12  role_name                   1478 non-null   object
 13  job_satisfaction            1478 non-null   object
 14  marital_status              1478 non-null   object
 15  monthly_income              1478 non-null   int64
 16  num_of_companies_worked     1478 non-null   int64
 17  over_time                   1478 non-null   object
 18  percent_salary_hike         1478 non-null   int64
 19  performance_rating          1478 non-null   object
 20  relationship_satisfaction   1478 non-null   object
 21  stock_option_level          1478 non-null   int64
 22  total_working_years         1478 non-null   int64
 23  work_life_balance           1478 non-null   object
 24  years_at_company            1478 non-null   int64
 25  years_in_current_role       1478 non-null   int64
 26  years_since_last_promotion  1478 non-null   int64
 27  years_with_current_manager  1478 non-null   int64
 28  city                        1478 non-null   object
 29  street                      1478 non-null   object
 30  state                       1478 non-null   object
 31  zipcode                     1478 non-null   int64
 32  training_name               1478 non-null   object
 33  training_description        1478 non-null   object
 34  attrition_date              237 non-null    object
 35  recruit_date                1478 non-null   object
 36  employee_number             1478 non-null   int64
 37  payroll_date                1478 non-null   object
 38  total_amount                1478 non-null   float64
 39  first_name                  1478 non-null   object
 40  last_name                   1478 non-null   object
 41  recruiter_name              1478 non-null   object
dtypes: float64(1), int64(14), object(27)
memory usage: 485.1+ KB

In [7]:
df.employee_id.duplicated().sum()

8

##### This tells us that there are duplicate rows in the data.

## ETL

#### Our ETL processing principle is to handle the ETL process for each table in the order of the table schema we created. We have a total of 17 table schemas. Tables with only primary keys and no foreign keys should be prioritized and processed before working on tables that contains foreign keys.

### ETL the recruiter table

In [8]:
# Create recruiter table
temp_recruiter_df =pd.DataFrame(df.recruiter_name.unique(), columns=['recruiter_name'])

# Add incrementing integers
temp_recruiter_df.insert(0, 'recruiter_id', range(1, 1 + len(temp_recruiter_df)))

# ETL to sql
temp_recruiter_df.to_sql(name='recruiter', con=engine, if_exists='append', index=False)

temp_recruiter_df

    recruiter_id      recruiter_name
0              1     Elfrida Duligal
1              2     Lebbie Collough
2              3     Whitney Leatham
3              4     Robers Campagne
4              5      Monti Cowpland
5              6   Jennilee Proffitt
6              7  Janeczka Brownsell
7              8       Josiah Kenvin
8              9     Pauli Chipchase
9             10       Ginni Amiable
10            11   Constantin Durand
11            12       Dannel Cleugh
12            13           Robbi Mac
13            14       Dorotea Mound
14            15        Neysa Nassie

In [9]:
# Map recruiter_id
recruiter_id_list = [temp_recruiter_df.recruiter_id[temp_recruiter_df.recruiter_name == i].values[0] for i in df.recruiter_name]

# Add recruiter_id to the main dataframe
df.insert(41, 'recruiter_id', recruiter_id_list)

### ETL the location table

In [10]:
# Create recruiter table
temp_location_df =pd.DataFrame(df.street.unique(), columns=['street'])

# Add incrementing integers
temp_location_df.insert(0, 'location_id', range(1, 1 + len(temp_location_df)))

In [11]:
# Map location_id
location_id_list = [temp_location_df.location_id[temp_location_df.street == i].values[0] for i in df.street]

# Add location_id to the main dataframe
df.insert(28, 'location_id', location_id_list)

In [12]:
temp_location_df = df[['location_id','city','street','state','zipcode','distance_from_home']].\
     drop_duplicates()

temp_location_df

,location_id,city,street,state,zipcode,distance_from_home
0,1,New York,8 Farmco Street,NY,10019,1
1,2,New York,83 Service Circle,NY,10023,8
2,3,New York,0 Morning Way,NY,10011,2
3,4,New York,0189 Jenna Plaza,NY,10001,3
7,5,New York,102 Carpenter Plaza,NY,10027,24
8,6,New York,08 Cardinal Crossing,NY,10013,23
9,7,New York,3 Namekagon Way,NY,10010,27
10,8,New York,408 Roth Avenue,NY,10033,16
11,9,New York,076 Talmadge Junction,NY,10025,15
12,10,New York,2 Moulton Plaza,NY,10038,26
13,11,New York,63 Commercial Park,NY,10016,19
15,12,New York,10983 Basil Plaza,NY,10005,21
16,13,New York,8804 Jackson Point,NY,10022,5
20,14,New York,61070 Summit Park,NY,10005,11
21,15,New York,60 Daystar Pass,NY,10003,9
22,16,New York,138 Marcy Terrace,NY,10054,7
24,17,New York,166 Pawling Road,NY,10034,6
31,18,New York,4 Spohn Trail,NY,10004,10
40,19,New York,6 Melrose Parkway,NY,10021,4
42,20,New York,02 Michigan Point,NY,10036,25
45,21,New York,56592 Weeping Birch Avenue,NY,10014,12
56,22,New York,42756 Caliangt Trail,NY,10028,18
61,23,New York,990 Apple Plaza,NY,10066,29
121,24,New York,3 Melody Point,NY,10007,22
122,25,New York,7376 Straubel Court,NY,10030,14
129,26,New York,6 Gerald Point,NY,10052,20
130,27,New York,94 Green Ridge Plaza,NY,10006,28
170,28,New York,57326 Northfield Place,NY,10024,17
184,29,New York,47738 2nd Alley,NY,10018,13
1114,30,New York,741 Cambridge Court,NY,10026,15

In [13]:
# ETL to sql
df[['location_id','city','street','state','distance_from_home','zipcode']].\
     drop_duplicates().to_sql(name='location', con=engine, if_exists='append',index=False)

### ETL the department table

In [14]:
# Create department table
temp_department_df =pd.DataFrame(df.dept_name.unique(), columns=['dept_name'])

# Add incrementing integers
temp_department_df.insert(0, 'department_id', range(1, 1 + len(temp_department_df)))

In [15]:
# Map department_id
department_id_list = [temp_department_df.department_id[temp_department_df.dept_name == i].values[0] for i in df.dept_name]

# Add product_id to the main dataframe
df.insert(3, 'department_id', department_id_list)

In [16]:
# Create department dataframe
temp_department_df = df[['department_id','dept_name','employee_number']].\
     drop_duplicates()

# ETL to sql
temp_department_df.to_sql(name='department', con=engine, if_exists='append', index=False)

temp_department_df

    department_id               dept_name  employee_number
0               1                   Sales              450
1               2  Research & Development             1000
79              3         Human Resources               65

### ETL the employee table

In [17]:
# Create employee table
temp_employee_df =df[['employee_id','last_name','first_name','age','gender','marital_status','education_level','education_filed','location_id','department_id']].\
      drop_duplicates()

# ETL to sql
temp_employee_df.to_sql(name='employee', con=engine, if_exists='append', index=False)

temp_employee_df

,employee_id,last_name,first_name,age,gender,marital_status,education_level,education_filed,location_id,department_id
0,1,Cattle,Ferne,41,Female,Single,College,Life Sciences,1,1
1,2,McCrone,Betta,49,Male,Married,Below College,Life Sciences,2,2
2,4,Swainsbury,Vonny,37,Male,Single,College,Other,3,2
3,5,Dennistoun,Jacquette,33,Female,Married,Master,Life Sciences,4,2
4,7,Gartin,Frederic,27,Male,Married,Below College,Medical,3,2
...,...,...,...,...,...,...,...,...,...,...
1465,2061,Guiver,Michelle,36,Male,Married,College,Medical,6,2
1466,2062,Brennan,Sullivan,39,Male,Married,Below College,Medical,17,2
1467,2064,March,Kirbee,27,Male,Married,Bachelor,Life Sciences,19,2
1468,2065,Pinder,Lorilee,49,Male,Married,Bachelor,Medical,3,1
1469,2068,Melby,Isis,34,Male,Married,Bachelor,Medical,2,2

### ETL the interview table

In [18]:
# Create interview table
temp_interview_df =df[['employee_id','recruiter_id','recruit_date','interview_performance']].\
      drop_duplicates()

# ETL to sql
temp_interview_df.to_sql(name='interview', con=engine, if_exists='append', index=False)

temp_interview_df

      employee_id  recruiter_id recruit_date interview_performance
0               1             1    2/21/2018             Excellent
1               2             2    1/12/2018                  Good
2               4             3     2/1/2018                  Good
3               5             4   11/23/2017             Excellent
4               7             5    7/20/2018             Excellent
...           ...           ...          ...                   ...
1465         2061            14   12/24/2017           Outstanding
1466         2062            15    2/11/2018                  Good
1467         2064             1    2/16/2018           Outstanding
1468         2065            15    4/12/2018                  Good
1469         2068            13     6/9/2018           Outstanding

[1470 rows x 4 columns]

### ETL the job history table

In [19]:
# Create job history table
temp_job_history_df =df[['num_of_companies_worked','total_working_years','employee_id']].\
      drop_duplicates()

# Add incrementing integers
temp_job_history_df.insert(0, 'employee_his_id', range(1, 1 + len(temp_job_history_df)))

# ETL to sql
temp_job_history_df.to_sql(name='job_history', con=engine, if_exists='append', index=False)

temp_job_history_df

,employee_his_id,num_of_companies_worked,total_working_years,employee_id
0,1,8,8,1
1,2,1,10,2
2,3,6,7,4
3,4,1,8,5
4,5,9,6,7
...,...,...,...,...
1465,1466,4,17,2061
1466,1467,4,9,2062
1467,1468,1,6,2064
1468,1469,2,17,2065
1469,1470,2,6,2068

### ETL the attrition table

In [20]:
# Create attrition table
temp_attrition_df =df[['attrition_status','attrition_date','employee_id']].\
      drop_duplicates()

# Add incrementing integers
temp_attrition_df.insert(0, 'attrition_id', range(1, 1 + len(temp_attrition_df)))

# ETL to sql
temp_attrition_df.to_sql(name='attrition', con=engine, if_exists='append', index=False)

temp_attrition_df

      attrition_id attrition_status attrition_date  employee_id
0                1              Yes     12/19/2020            1
1                2               No            NaN            2
2                3              Yes      6/19/2021            4
3                4               No            NaN            5
4                5               No            NaN            7
...            ...              ...            ...          ...
1465          1466               No            NaN         2061
1466          1467               No            NaN         2062
1467          1468               No            NaN         2064
1468          1469               No            NaN         2065
1469          1470               No            NaN         2068

[1470 rows x 4 columns]

### ETL the promotion table

In [21]:
# Create promotion table
temp_promotion_df =df[['years_since_last_promotion','performance_rating','employee_id']].\
      drop_duplicates()

# Add incrementing integers
temp_promotion_df.insert(0, 'promotion_id', range(1, 1 + len(temp_promotion_df)))

# ETL to sql
temp_promotion_df.to_sql(name='promotion', con=engine, if_exists='append', index=False)

temp_promotion_df

      promotion_id  years_since_last_promotion performance_rating  employee_id
0                1                           0          Excellent            1
1                2                           1        Outstanding            2
2                3                           0          Excellent            4
3                4                           3          Excellent            5
4                5                           2          Excellent            7
...            ...                         ...                ...          ...
1465          1466                           0          Excellent         2061
1466          1467                           1          Excellent         2062
1467          1468                           0        Outstanding         2064
1468          1469                           0          Excellent         2065
1469          1470                           1          Excellent         2068

[1470 rows x 4 columns]

### ETL the training table

In [22]:
# Create training table
temp_training_df =df[['training_name','training_description']].\
      drop_duplicates()

# Add incrementing integers
temp_training_df.insert(0, 'training_id', range(1, 1 + len(temp_training_df)))

# ETL to sql
temp_training_df.to_sql(name='training', con=engine, if_exists='append', index=False)

temp_training_df

,training_id,training_name,training_description
0,1,Product or service training,About the products or services
1,2,Technical skill training,Programing skills
79,3,Compliance training,Fulfill certain legal obligations to perform jobs
1470,4,Soft skills training,Soft skills as a combination of personality tr...

In [23]:
# Map training_id
training_id_list = [temp_training_df.training_id[temp_training_df.training_name == i].values[0] for i in df.training_name]

# Add training_id to the main dataframe
df.insert(32, 'training_id', training_id_list)

### ETL the employee training table

In [24]:
# Create employee training table
temp_employee_training_df =df[['training_id','employee_id']].\
      drop_duplicates()

# ETL to sql
temp_employee_training_df.to_sql(name='employee_training', con=engine, if_exists='append', index=False)

temp_employee_training_df

      training_id  employee_id
0               1            1
1               2            2
2               2            4
3               2            5
4               2            7
...           ...          ...
1473            4         2061
1474            4         2062
1475            4         2064
1476            4         2065
1477            4         2068

[1478 rows x 2 columns]

### ETL the survey table

In [25]:
# Create survey table
temp_survey_df =df[['environment_satisfaction','job_satisfaction','relationship_satisfaction','work_life_balance','employee_id']].\
      drop_duplicates()

# Add incrementing integers
temp_survey_df.insert(0, 'survey_id', range(1, 1 + len(temp_survey_df)))

# ETL to sql
temp_survey_df.to_sql(name='survey', con=engine, if_exists='append', index=False)

temp_survey_df

,survey_id,environment_satisfaction,job_satisfaction,relationship_satisfaction,work_life_balance,employee_id
0,1,Medium,Very High,Low,Bad,1
1,2,High,Medium,Very High,Better,2
2,3,Very High,High,Medium,Better,4
3,4,Very High,High,High,Better,5
4,5,Low,Medium,Very High,Better,7
...,...,...,...,...,...,...
1465,1466,High,Very High,High,Better,2061
1466,1467,Very High,Low,Low,Better,2062
1467,1468,Medium,Medium,Medium,Better,2064
1468,1469,Very High,Medium,Very High,Good,2065
1469,1470,Medium,High,Low,Best,2068

### ETL the history in company table

In [26]:
# Create history in company table
temp_history_in_company_df =df[['years_with_current_manager','years_at_company','employee_id']].\
      drop_duplicates()

# Add incrementing integers
temp_history_in_company_df.insert(0, 'history_id', range(1, 1 + len(temp_history_in_company_df)))

# ETL to sql
temp_history_in_company_df.to_sql(name='history_in_company', con=engine, if_exists='append', index=False)

temp_history_in_company_df

      history_id  years_with_current_manager  years_at_company  employee_id
0              1                           5                 6            1
1              2                           7                10            2
2              3                           0                 0            4
3              4                           0                 8            5
4              5                           2                 2            7
...          ...                         ...               ...          ...
1465        1466                           3                 5         2061
1466        1467                           7                 7         2062
1467        1468                           3                 6         2064
1468        1469                           8                 9         2065
1469        1470                           2                 4         2068

[1470 rows x 4 columns]

### ETL the reference job role table

In [27]:
# Create ref job role table
temp_REF_job_role_df =df[['role_name']].\
      drop_duplicates()

# Add incrementing integers
temp_REF_job_role_df.insert(0, 'role_id', range(1, 1 + len(temp_REF_job_role_df)))

# ETL to sql
temp_REF_job_role_df.to_sql(name='ref_job_role', con=engine, if_exists='append', index=False)

temp_REF_job_role_df

    role_id                  role_name
0         1            Sales Executive
1         2         Research Scientist
2         3      Laboratory Technician
8         4     Manufacturing Director
9         5  Healthcare Representative
18        6                    Manager
21        7       Sales Representative
22        8          Research Director
79        9            Human Resources

In [28]:
# Map role_id
REF_job_role_list = [temp_REF_job_role_df.role_id[temp_REF_job_role_df.role_name == i].values[0] for i in df.role_name]

# Add role_id to the main dataframe
df.insert(12, 'role_id', REF_job_role_list)

### ETL the reference job level table

In [29]:
# Create ref job level table
temp_REF_job_level_df =df[['level_desc']].\
      drop_duplicates()

# Add incrementing integers
temp_REF_job_level_df.insert(0, 'level_id', range(1, 1 + len(temp_REF_job_level_df)))

# ETL to sql
temp_REF_job_level_df.to_sql(name='ref_job_level', con=engine, if_exists='append', index=False)

temp_REF_job_level_df

    level_id level_desc
0          1    level 2
2          2    level 1
8          3    level 3
18         4    level 4
25         5    level 5

In [30]:
# Map level_id
REF_job_level_list = [temp_REF_job_level_df.level_id[temp_REF_job_level_df.level_desc == i].values[0] for i in df.level_desc]

# Add level_id to the main dataframe
df.insert(11, 'level_id', REF_job_level_list)

### ETL the job table

In [31]:
# Create job table
temp_job_df =df[['business_travel','years_in_current_role','role_id','level_id','employee_id']].\
      drop_duplicates()

# Add incrementing integers
temp_job_df.insert(0, 'job_id', range(1, 1 + len(temp_job_df)))

# ETL to sql
temp_job_df.to_sql(name='job', con=engine, if_exists='append', index=False)

temp_job_df

,job_id,business_travel,years_in_current_role,role_id,level_id,employee_id
0,1,Travel_Rarely,4,1,1,1
1,2,Travel_Frequently,7,2,1,2
2,3,Travel_Rarely,0,3,2,4
3,4,Travel_Frequently,7,2,2,5
4,5,Travel_Rarely,2,3,2,7
...,...,...,...,...,...,...
1465,1466,Travel_Frequently,2,3,1,2061
1466,1467,Travel_Rarely,7,5,3,2062
1467,1468,Travel_Rarely,2,4,1,2064
1468,1469,Travel_Frequently,6,1,1,2065
1469,1470,Travel_Rarely,3,3,1,2068

In [32]:
# Map job_id
job_list = [temp_job_df.job_id[temp_job_df.employee_id == i].values[0] for i in df.employee_id]

# Add job_id to the main dataframe
df.insert(10, 'job_id', job_list)

### ETL the salary table

In [33]:
# Create salary table
temp_salary_df =df[['monthly_income','percent_salary_hike','stock_option_level','job_id']].\
      drop_duplicates()

# Add incrementing integers
temp_salary_df.insert(0, 'salary_id', range(1, 1 + len(temp_salary_df)))

# ETL to sql
temp_salary_df.to_sql(name='salary', con=engine, if_exists='append', index=False)

temp_salary_df

,salary_id,monthly_income,percent_salary_hike,stock_option_level,job_id
0,1,5993,11,0,1
1,2,5130,23,1,2
2,3,2090,15,0,3
3,4,2909,11,0,4
4,5,3468,12,1,5
...,...,...,...,...,...
1465,1466,2571,17,1,1466
1466,1467,9991,15,1,1467
1467,1468,6142,20,1,1468
1468,1469,5390,14,0,1469
1469,1470,4404,12,0,1470

In [34]:
# Map salary_id
salary_list = [temp_salary_df.salary_id[temp_salary_df.job_id == i].values[0] for i in df.job_id]

# Add salary_id to the main dataframe
df.insert(15, 'salary_id', salary_list)

### ETL the payroll table

In [35]:
# Create payroll table
temp_payroll_df =df[['employee_id','salary_id','payroll_date','total_amount','over_time']].\
      drop_duplicates()

# Add incrementing integers
temp_payroll_df.insert(0, 'payroll_id', range(1, 1 + len(temp_payroll_df)))

# ETL to sql
temp_payroll_df.to_sql(name='payroll', con=engine, if_exists='append', index=False)

temp_payroll_df

      payroll_id  employee_id  salary_id payroll_date  total_amount over_time
0              1            1          1   11/22/2019       6891.95       Yes
1              2            2          2    12/7/2021       5899.50        No
2              3            4          3     8/9/2020       2403.50       Yes
3              4            5          4    9/25/2020       3345.35       Yes
4              5            7          5     4/3/2021       3988.20        No
...          ...          ...        ...          ...           ...       ...
1465        1466         2061       1466    6/21/2020       2956.65        No
1466        1467         2062       1467    4/14/2020      11489.65        No
1467        1468         2064       1468   11/16/2020       7063.30       Yes
1468        1469         2065       1469    8/26/2019       6198.50        No
1469        1470         2068       1470    9/10/2019       5064.60        No

[1470 rows x 6 columns]

## Analytical Procedures

### With our sql database, we can write query in python to extract the content of the information we need and quickly analyze it to find the desired answer. Next are 14 data analysis questions we show that can help companies better understand attrition. This is just an example, our database can do includes but is not limited to these 14 questions.

#### 1. What percentage of those who left the company were in the Sales department with above average salaries?

In [36]:
query = """
            SELECT count(e.employee_id) AS num_of_emp_left
            FROM employee e
            LEFT JOIN attrition a
            ON e.employee_id = a.employee_id
            WHERE attrition_status = 'true' 
        """

# Execute the statement and get the results
results = connection.execute(query).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df = pd.DataFrame(results, columns=column_names)

# Show results
temp_df

   num_of_emp_left
0              237

In [37]:
query1 = """
            SELECT count(e.employee_id) AS num_of_emp_left_in_sales
            FROM employee e
            LEFT JOIN job j
            ON e.employee_id = j.employee_id
            LEFT JOIN salary s
            ON j.job_id = s.job_id
            LEFT JOIN department d
            on e.department_id = d.department_id
            LEFT JOIN attrition a
            ON e.employee_id = a.employee_id
            WHERE attrition_status = 'true' 
            AND dept_name = 'Sales' 
            AND monthly_income > (SELECT AVG(monthly_income) FROM salary);
        """

# Execute the statement and get the results
results = connection.execute(query1).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df1 = pd.DataFrame(results, columns=column_names)

# Show results
temp_df1

   num_of_emp_left_in_sales
0                        32

In [38]:
emp_left_in_sales_pre = temp_df1.num_of_emp_left_in_sales / temp_df.num_of_emp_left *100
precentage_df =pd.DataFrame(emp_left_in_sales_pre, columns=['% Sales Employee left'] )

precentage_df

   % Sales Employee left
0               13.50211

#### 2. What percentage of those who left the company were in the  R & D department department with below average salaries?

In [39]:
query2 = """
            SELECT count(e.employee_id) AS num_of_emp_left_in_R_D
            FROM employee e
            LEFT JOIN job j
            ON e.employee_id = j.employee_id
            LEFT JOIN salary s
            ON j.job_id = s.job_id
            LEFT JOIN department d
            on e.department_id = d.department_id
            LEFT JOIN attrition a
            ON e.employee_id = a.employee_id
            WHERE attrition_status = 'true' 
            AND dept_name = 'Research & Development' 
            AND monthly_income < (SELECT AVG(monthly_income) FROM salary);
        """

# Execute the statement and get the results
results = connection.execute(query2).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df2 = pd.DataFrame(results, columns=column_names)

# Show results
temp_df2

   num_of_emp_left_in_r_d
0                     115

In [40]:
emp_left_in_RD_pre = temp_df2.num_of_emp_left_in_r_d / temp_df.num_of_emp_left *100
precentage_df2 =pd.DataFrame(emp_left_in_RD_pre, columns=['% RD Employee left'] )

precentage_df2

   % RD Employee left
0           48.523207

#### 3. What percentage of those who left the company were in the  HR department with average salaries?

In [41]:
query3 = """
            SELECT count(e.employee_id) AS num_of_emp_left_in_hr
            FROM employee e
            LEFT JOIN job j
            ON e.employee_id = j.employee_id
            LEFT JOIN salary s
            ON j.job_id = s.job_id
            LEFT JOIN department d
            on e.department_id = d.department_id
            LEFT JOIN attrition a
            ON e.employee_id = a.employee_id
            WHERE attrition_status = 'true' 
            AND dept_name = 'Human Resources' 
            AND monthly_income = (SELECT AVG(monthly_income) FROM salary);
        """

# Execute the statement and get the results
results = connection.execute(query3).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df3 = pd.DataFrame(results, columns=column_names)

# Show results
temp_df3

   num_of_emp_left_in_hr
0                      0

In [42]:
emp_left_in_HR_pre = temp_df3.num_of_emp_left_in_hr / temp_df.num_of_emp_left *100
precentage_df3 =pd.DataFrame(emp_left_in_HR_pre, columns=['% HR Employee left'] )

precentage_df3

   % HR Employee left
0                 0.0

#### 4. By department and gender, what is the average age distribution of those leaving the company?

In [43]:
query4 = """
            SELECT ROUND(AVG(age),0) AS Average_Age, gender, dept_name
            FROM employee e
            LEFT JOIN attrition a
            ON e.employee_id = a.employee_id
            LEFT JOIN department d
            ON e.department_id = d.department_id
            WHERE attrition_status = 'true'
            GROUP BY gender, dept_name
            ORDER BY dept_name;
        """

# Execute the statement and get the results
results = connection.execute(query4).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df4 = pd.DataFrame(results, columns=column_names)

# Show results
temp_df4

  average_age  gender               dept_name
0          30  Female         Human Resources
1          31    Male         Human Resources
2          32  Female  Research & Development
3          34    Male  Research & Development
4          33  Female                   Sales
5          35    Male                   Sales

#### 5. By job position and level in each department, what is the marital status of those leaving the company?

In [44]:
query5 = """
            SELECT dept_name, role_name, level_desc, marital_status, count(marital_status)
            FROM salary s
            LEFT JOIN job j
            ON s.job_id = j.job_id
            LEFT JOIN ref_job_level jl
            ON j.level_id = jl.level_id
            LEFT JOIN ref_job_role jr
            ON j.role_id = jr.role_id
            LEFT JOIN employee e
            ON j.employee_id = e.employee_id
            LEFT JOIN department d
            ON e.department_id = d.department_id
            LEFT JOIN attrition a
            ON e.employee_id = a.employee_id
            WHERE attrition_status = 'true'
            GROUP BY marital_status, dept_name, role_name, level_desc
            ORDER BY dept_name;
        """

# Execute the statement and get the results
results = connection.execute(query5).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df5 = pd.DataFrame(results, columns=column_names)

# Show results
temp_df5

,dept_name,role_name,level_desc,marital_status,count
0,Human Resources,Human Resources,level 1,Divorced,4
1,Human Resources,Human Resources,level 3,Divorced,1
2,Human Resources,Human Resources,level 1,Married,5
3,Human Resources,Human Resources,level 3,Married,1
4,Human Resources,Human Resources,level 1,Single,1
5,Research & Development,Healthcare Representative,level 4,Divorced,1
6,Research & Development,Laboratory Technician,level 1,Divorced,11
7,Research & Development,Laboratory Technician,level 2,Divorced,1
8,Research & Development,Manufacturing Director,level 3,Divorced,1
9,Research & Development,Research Scientist,level 1,Divorced,4
10,Research & Development,Healthcare Representative,level 2,Married,3
11,Research & Development,Healthcare Representative,level 3,Married,3
12,Research & Development,Laboratory Technician,level 1,Married,17
13,Research & Development,Laboratory Technician,level 2,Married,2
14,Research & Development,Manager,level 3,Married,2
15,Research & Development,Manager,level 5,Married,1
16,Research & Development,Manufacturing Director,level 2,Married,4
17,Research & Development,Manufacturing Director,level 3,Married,2
18,Research & Development,Research Director,level 5,Married,1
19,Research & Development,Research Scientist,level 1,Married,13
20,Research & Development,Research Scientist,level 2,Married,1
21,Research & Development,Healthcare Representative,level 3,Single,2
22,Research & Development,Laboratory Technician,level 1,Single,28
23,Research & Development,Laboratory Technician,level 2,Single,2
24,Research & Development,Laboratory Technician,level 3,Single,1
25,Research & Development,Manufacturing Director,level 2,Single,1
26,Research & Development,Manufacturing Director,level 3,Single,2
27,Research & Development,Research Director,level 5,Single,1
28,Research & Development,Research Scientist,level 1,Single,28
29,Research & Development,Research Scientist,level 2,Single,1
30,Sales,Sales Executive,level 2,Divorced,4
31,Sales,Sales Executive,level 3,Divorced,2
32,Sales,Sales Representative,level 1,Divorced,4
33,Sales,Manager,level 5,Married,1
34,Sales,Sales Executive,level 2,Married,10
35,Sales,Sales Executive,level 3,Married,9
36,Sales,Sales Executive,level 4,Married,1
37,Sales,Sales Representative,level 1,Married,7
38,Sales,Sales Representative,level 2,Married,1
39,Sales,Manager,level 5,Single,1
40,Sales,Sales Executive,level 2,Single,22
41,Sales,Sales Executive,level 3,Single,6
42,Sales,Sales Executive,level 4,Single,3
43,Sales,Sales Representative,level 1,Single,21

#### 6. How is the distance from home effect the employeeâ€™s feeling on work and life balance? Does it affect attrition rates?

In [45]:
query6 = """
            SELECT distance_from_home, work_life_balance, count(e.employee_id) AS number_employee
            FROM location l
            LEFT JOIN employee e
            ON l.location_id = e.location_id
            LEFT JOIN survey s
            ON e.employee_id = s.employee_id
            LEFT JOIN attrition a
            ON e.employee_id = a.employee_id
            WHERE attrition_status = 'true'
            GROUP BY distance_from_home, work_life_balance
            ORDER BY distance_from_home;
        """

# Execute the statement and get the results
results = connection.execute(query6).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df6 = pd.DataFrame(results, columns=column_names)

# Show results
temp_df6

    distance_from_home work_life_balance  number_employee
0                    1               Bad                4
1                    1              Best                4
2                    1            Better               14
3                    1              Good                4
4                    2               Bad                2
..                 ...               ...              ...
79                  27              Good                1
80                  28            Better                2
81                  29              Best                1
82                  29            Better                3
83                  29              Good                1

[84 rows x 3 columns]

#### 7. How many current employees attended more than one training section?  What are their names?

In [46]:
query7 = """
            SELECT e.employee_id, first_name ||' '||last_name AS full_name
            FROM employee e
            LEFT JOIN employee_training et
            ON e.employee_id = et.employee_id
            LEFT JOIN attrition a
            ON e.employee_id = a.employee_id
            WHERE attrition_status = 'false'
            GROUP BY e.employee_id, full_name
            HAVING count(*)>1;
        """

# Execute the statement and get the results
results = connection.execute(query7).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df7 = pd.DataFrame(results, columns=column_names)

# Show results
temp_df7

   employee_id         full_name
0         2064      Kirbee March
1         2056  Randi Espinheira
2         2062  Sullivan Brennan
3         2057        Isac Ivamy
4         2061   Michelle Guiver
5         2060    Charil Siveyer
6         2068        Isis Melby
7         2065    Lorilee Pinder

#### 8. What effect does the male employee's interviewing performance have on their monthly income?

In [47]:
query8 = """
            SELECT interview_performance, ROUND(AVG(monthly_income),2) AS average_income
            FROM interview i
            LEFT JOIN employee e
            ON i.employee_id = e.employee_id
            LEFT JOIN payroll p
            ON e.employee_id = p.employee_id
            LEFT JOIN salary s
            ON p.salary_id = s.salary_id
            WHERE e.gender = 'Male'
            GROUP BY interview_performance
            ORDER BY average_income desc;
        """

# Execute the statement and get the results
results = connection.execute(query8).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df8 = pd.DataFrame(results, columns=column_names)

# Show results
temp_df8

  interview_performance average_income
0                  Good        6807.30
1             Excellent        6331.26
2           Outstanding        5932.38
3                   Low        5887.21

#### 9. Dose over time affect the job satisfaction rate?

In [48]:
query9 = """
            SELECT over_time, job_satisfaction, count(s.employee_id)
            FROM survey s
            LEFT JOIN employee e
            ON s.employee_id = e.employee_id
            LEFT JOIN payroll p
            ON e.employee_id = p.employee_id
            GROUP BY over_time, job_satisfaction
            ORDER BY job_satisfaction;
        """

# Execute the statement and get the results
results = connection.execute(query9).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df9 = pd.DataFrame(results, columns=column_names)

# Show results
temp_df9

   over_time job_satisfaction  count
0      False             High    321
1       True             High    121
2      False              Low    205
3       True              Low     84
4      False           Medium    211
5       True           Medium     69
6      False        Very High    317
7       True        Very High    142

#### 10. How is performance rating and years at company impact the salary rate?

In [49]:
query10 = """
            SELECT performance_rating, years_at_company, ROUND (AVG(monthly_income),2) AS average_income
            FROM promotion p
            LEFT JOIN employee e
            ON p.employee_id = e.employee_id
            LEFT JOIN history_in_company hc
            ON e.employee_id = hc.employee_id
            LEFT JOIN job b 
            ON e.employee_id = b.employee_id
            LEFT JOIN salary s
            ON b.job_id = s.job_id
            GROUP BY performance_rating, years_at_company
            ORDER BY years_at_company;
        """

# Execute the statement and get the results
results = connection.execute(query10).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df10 = pd.DataFrame(results, columns=column_names)

# Show results
temp_df10

   performance_rating  years_at_company average_income
0           Excellent                 0        3477.24
1         Outstanding                 0        7476.57
2         Outstanding                 1        3934.90
3           Excellent                 1        4833.74
4         Outstanding                 2        5409.18
..                ...               ...            ...
60          Excellent                34       16856.00
61          Excellent                36       19045.00
62        Outstanding                36       19586.00
63          Excellent                37       13872.00
64          Excellent                40       10312.00

[65 rows x 3 columns]

#### 11. How much does a frequently traveling level 5 manager of the R & D department make in salary on average?

In [54]:
query11 = """
            SELECT ROUND(AVG(monthly_income),0) AS average_salary
            FROM salary s
            LEFT JOIN job j
            ON s.job_id = j.job_id
            LEFT JOIN ref_job_level jl
            ON j.level_id = jl.level_id
            LEFT JOIN ref_job_role jr
            ON j.role_id = jr.role_id
            LEFT JOIN employee e
            ON j.employee_id = e.employee_id
            LEFT JOIN department d
            ON e.department_id = d.department_id
            WHERE dept_name = 'Research & Development'
            AND role_name = 'Manager'
            AND level_desc = 'level 5'
            AND business_travel = 'Travel_Frequently';
        """

# Execute the statement and get the results
results = connection.execute(query11).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df11 = pd.DataFrame(results, columns=column_names)

# Show results
temp_df11

  average_salary
0          18740

#### 12. Who interviewed employee_id 1 and how was employee_id 1's interview performance? When was the interview date?

In [51]:
query12 = """
            SELECT recruiter_name, interview_performance, recruit_date
            FROM recruiter r
            LEFT JOIN interview i
            ON r.recruiter_id = i.recruiter_id
            LEFT JOIN employee e
            ON i.employee_id = e.employee_id
            WHERE e.employee_id = '1';
        """

# Execute the statement and get the results
results = connection.execute(query12).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df12 = pd.DataFrame(results, columns=column_names)

# Show results
temp_df12

    recruiter_name interview_performance recruit_date
0  Elfrida Duligal             Excellent   2018-02-21

#### 13. Which training program had the most people attended?

In [52]:
query13 = """
            SELECT training_name, count(et.training_id) AS number_employee_attended,
            RANK() OVER ( ORDER BY count(et.training_id) DESC) training_rank
            FROM training t
            LEFT JOIN employee_training et
            ON t.training_id = et.training_id
            GROUP BY training_name
            Limit 1;
        """

# Execute the statement and get the results
results = connection.execute(query13).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df13 = pd.DataFrame(results, columns=column_names)

# Show results
temp_df13

              training_name  number_employee_attended  training_rank
0  Technical skill training                       961              1

#### 14. How many people who interviewed in 2017 have left the company in 2020?

In [53]:
query14 = """
            SELECT count(e.employee_id) AS number_of_employee
            FROM employee e
            LEFT JOIN attrition a
            ON e.employee_id = a.employee_id
            LEFT JOIN interview i
            ON e.employee_id = i.employee_id
            WHERE attrition_status = 'true'
            AND recruit_date BETWEEN '2017-01-01' AND '2017-12-31'
            AND attrition_date BETWEEN '2020-01-01' AND '2020-12-31';
        """

# Execute the statement and get the results
results = connection.execute(query14).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df14 = pd.DataFrame(results, columns=column_names)

# Show results
temp_df14

   number_of_employee
0                  29

### Drop tables

#### This section is only used if we want to remove all tables.

In [ ]:
connection.execute("""DROP TABLE payroll;
               DROP TABLE salary;
               DROP TABLE job;
               DROP TABLE REF_job_level;
               DROP TABLE REF_job_role;
               DROP TABLE history_in_company;
               DROP TABLE survey;
               DROP TABLE employee_training;
               DROP TABLE training;
               DROP TABLE promotion;
               DROP TABLE attrition;
               DROP TABLE job_history;
               DROP TABLE interview;
               DROP TABLE employee;
               DROP TABLE department;
               DROP TABLE location;
               DROP TABLE recruiter;
            """)